Repository: greenjellygit/angular-i18n-to-transloco-migrate
Catalog: src/i18n/messages.*.xlf
Languages: pl

# app.component.full
source: Text content - full i18n tag with the description and the key
pl: Treść tekstowa - pełny tag i18n z opisem i kluczem

source: Text content - simplest i18n tag only
pl: Treść tekstowa - tylko najprostszy znacznik i18n

# app.component.input-placeholder-full
source: to provide - input-placeholder-full
pl: zapewnić - input-placeholder-full

source: to provide
pl: zapewnić

# app.component.input-many-attributes-placeholder
source: Many attributes on input - title
pl: Dużo atrybutów na inpucie - tytuł

# app.component.child-translate
source: Text content - this is child
pl: Treść tekstowa - to jest dziecko

# app.component.input-many-attributes-title
source: Many attributes i18n (title)
pl: Wiele atrybutów i18n (tytuł)

# app.component.parent-title
source: Title of nested element
pl: Tytuł zagnieżdżonego elementu

# app.component.child-translate-interpolation
source: Text content - this is child - interpolation - '{{el}}'
pl: Treść tekstowa - to jest dziecko - interpolacja - '{{el}}'

# app.component.child-translate-html
source: Text content - this is child - <span><b>HTML</b></span>
pl: Zawartość tekstowa - to jest dziecko - <span><b>HTML</b></span>

# app.component.child-translate-interpolation-html
source: Text content - this is html child with interpolation - <span><b>{{999 + el + 999}}</b></span>
pl: Zawartość tekstowa - to jest dziecko html z interpolacją - <span><b>{{999 + el + 999}}</b></span>

# people-invite.component.users-limit-info-remaining
source: You can invite only <b>{{maxNumberOfInvitations}}</b> more {maxNumberOfInvitations, plural, =1 {...} other {...}} before reaching the limit (<b>{{numberOfUsersLimit}}</b>) for your organization.
pl: Możesz zaprosić tylko <b>{{maxNumberOfInvitations}}</b> więcej {maxNumberOfInvitations, plural, =1 {...} other {...}} zanim osiągniesz limit (<b>{{numberOfUsersLimit}}</b>) dla twojej organizacji.

source: {VAR_PLURAL, plural, =1 {person} other {people} }
pl: {VAR_PLURAL, plural, =1 {osobę} other {osób} }

# addon-required.component.oops
source: <b>Oops..</b>
pl: <b>Upsik..</b>

# common.buttons.update
source: UPDATE
pl: AKTUALIZACJA

# teams-edit.component.team-context-singular
source: Hello this is select: {objSelect['context'].value, select, UNIT {...} TEAM {...} PROJECT {...}} {objSelect, select, 234 {...} ASD {...} zxc {...}}
pl: Hejo tu select: {objSelect['context'].value, select, UNIT {...} TEAM {...} PROJECT {...}} {objSelect, select, 234 {...} ASD {...} zxc {...}}

source: {VAR_SELECT, select, UNIT {UNIT} TEAM {TEAM} PROJECT {PROJECT} }
pl: {VAR_SELECT, select, UNIT {JEDNOSTKA} TEAM {ZESPÓŁ} PROJECT {PROJEKT} }

source: {VAR_SELECT, select, 234 {number} ASD {this is asd} zxc {this is zxc} }
pl: {VAR_SELECT, select, 234 {liczba} ASD {to jest asd} zxc {to jest zxc} }

source: {VAR_SELECT, select, 234 {{{value + 1}} } ASD {ASD} zxc {<span>text html</span>} }
pl: {VAR_SELECT, select, 234 {{{value + 1}} } ASD {aesde} zxc {<span>tekst html-owy</span>} }

source: {VAR_PLURAL, plural, =1 {Requested by {{addon.requestsCount}} user} other {Requested by {{addon.requestsCount}} users} }
pl: {VAR_PLURAL, plural, =1 { Żądane przez {{addon.requestsCount}} użytkownika } other { Żądane przez {{addon.requestsCount}} użytkowników } }

# teams-edit.component.create-new
source: CREATE NEW
pl: TWORZENIE NOWYCH

# teams-edit.component.edit-team
source: EDIT
pl: EDYCJA

# teams-edit.component.team-context-singular-zxc
source: {VAR_SELECT, select, UNIT {UNIT} TEAM {TEAM} PROJECT {PROJECT} }
pl: {VAR_SELECT, select, UNIT {JEDNOSTKĘ} TEAM {ZESPÓŁ} PROJECT {PROJEKT} }

# common.errors.password-wrong-pattern-error
source: Password does not meet the
pl: Hasło nie jest zgodne z

# common.errors.expected-pattern
source: expected pattern
pl: oczekiwany wzór

# wall-post-list-item.component.important-badge
source: Important
pl: Ważny

# wall.common.filter-by-important
source: Filter by important
pl: Filtruj według ważnych

# wall-post-list-item.component.new-badge
source: New
pl: Nowy

# wall.common.filter-by-new
source: Filter by new
pl: Filtruj według nowego

source: {VAR_PLURAL, plural, =1 {Requested by {{addon.requestsCount}} user} other {Requested by {{addon.requestsCountAaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa}} users} }
pl: {VAR_PLURAL, plural, =1 { Żądane przez {{addon.requestsCount}} użytkownika } other { Żądane przez {{addon.requestsCountAaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa}} użytkowników } }
